In [1]:
import pandas as pd

In [2]:
l = [1,2,3,4,5,6]
var = pd.DataFrame(l)
print(type(var))

<class 'pandas.core.frame.DataFrame'>

In [3]:
d = {"a":[1,2,3,4,5],"s":[1,2,3,4,5],"d":[1,2,3,4,5],1:[1,2,3,4,5]}
# data ki value barabar honi vhahiye
var1 = pd.DataFrame(d)
print(type(var1))
print(var1)

<class 'pandas.core.frame.DataFrame'>
   a  s  d  1
0  1  1  1  1
1  2  2  2  2
2  3  3  3  3
3  4  4  4  4
4  5  5  5  5

In [4]:

var2 = pd.DataFrame(d, columns=["a",1])
print(type(var2))
print(var2)

<class 'pandas.core.frame.DataFrame'>
   a  1
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5

In [5]:
var3 = pd.DataFrame(d, columns=["a",1], index=["a","s","d","f","g"])
print(type(var3))
print(var3)

<class 'pandas.core.frame.DataFrame'>
   a  1
a  1  1
s  2  2
d  3  3
f  4  4
g  5  5

In [6]:
print(var1["a"][3])

4

In [7]:
l = [[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15]]

var4 = pd.DataFrame(l)
print(type(var4))
print(var4)

<class 'pandas.core.frame.DataFrame'>
    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15

In [8]:
sr = {"s":pd.Series([1,2,3,4]),"t":pd.Series([5,6,7,8])}
var5 = pd.DataFrame(sr)
print(type(var5))
print(var5)

<class 'pandas.core.frame.DataFrame'>
   s  t
0  1  5
1  2  6
2  3  7
3  4  8

# Arthimetic operation in Python Pandas

In [9]:
var6 = pd.DataFrame({"A":[1,2,3,4], "B":[5,6,7,8]})
print(var6)

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [10]:
var6["c"] = var6["A"]*var6["B"] #all ops possible
print(var6)

   A  B   c
0  1  5   5
1  2  6  12
2  3  7  21
3  4  8  32

In [11]:
var7 = pd.DataFrame({"A":[10,20,30,40],"B":[15,16,17,18]})
var7

    A   B
0  10  15
1  20  16
2  30  17
3  40  18

In [12]:
var7["python"]= var7["A"]<=20
var7["python2"]= var7["A"]>=16
var7

    A   B  python  python2
0  10  15    True    False
1  20  16    True     True
2  30  17   False     True
3  40  18   False     True

## Delete and modify

In [13]:
var8 = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})
var8

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

In [14]:
var8.insert(1,"python",var8["A"])
var8

   A  python  B
0  1       1  9
1  2       2  8
2  3       3  7
3  4       4  6
4  5       5  5

In [15]:
var8.insert(1,"python2",[11,12,13,14,14])
var8

   A  python2  python  B
0  1       11       1  9
1  2       12       2  8
2  3       13       3  7
3  4       14       4  6
4  5       14       5  5

In [16]:
var8["python3"]=var8["A"][:3]
var8

   A  python2  python  B  python3
0  1       11       1  9      1.0
1  2       12       2  8      2.0
2  3       13       3  7      3.0
3  4       14       4  6      NaN
4  5       14       5  5      NaN

## Delete

In [17]:
var8.pop("python3")
var8

   A  python2  python  B
0  1       11       1  9
1  2       12       2  8
2  3       13       3  7
3  4       14       4  6
4  5       14       5  5